#### Terraform Format and Style 🖌``
Environment: dev
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.default: Reading...
data.aws_caller_identity.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-03450afa57a6288df]
module.eks_blueprints_kubernetes_addons.data.aws_caller_identity.current: Reading...
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-034f697d05267b01e]
data.aws_availability_zones.available: Reading...
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.eks_blueprints_kubernetes_addons.data.aws_partition.current: Reading...
module.eks_blueprints.data.aws_region.current: Reading...
module.eks_blueprints_kubernetes_addons.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.eks_blueprints.data.aws_caller_identity.current: Reading...
module.eks_blueprints.data.aws_region.current: Read complete after 0s [id=ap-southeast-2]
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2053943846]
module.eks_blueprints.module.aws_eks.data.aws_partition.current: Reading...
module.eks_blueprints.module.aws_eks.data.aws_caller_identity.current: Reading...
module.eks_blueprints.module.aws_eks.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_region.current: Reading...
module.eks_blueprints.data.aws_partition.current: Reading...
module.eks_blueprints.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_blueprints.module.aws_eks.module.kms.data.aws_caller_identity.current: Reading...
data.aws_region.current: Read complete after 0s [id=ap-southeast-2]
module.eks_blueprints_kubernetes_addons.data.aws_region.current: Reading...
module.eks_blueprints_kubernetes_addons.data.aws_region.current: Read complete after 0s [id=ap-southeast-2]
module.eks_blueprints.module.aws_eks.module.kms.data.aws_partition.current: Reading...
module.eks_blueprints.module.aws_eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20221022101602452100000002]
data.aws_caller_identity.default: Read complete after 1s [id=158237136693]
data.aws_caller_identity.current: Read complete after 1s [id=158237136693]
module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::158237136693:policy/vpc-flow-log-to-cloudwatch-20221022101602450100000001]
module.eks_blueprints.module.aws_eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_blueprints.module.aws_eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks_blueprints.module.aws_eks.aws_iam_role.this[0]: Refreshing state... [id=django-for-impatient-cluster-role]
module.eks_blueprints_kubernetes_addons.data.aws_caller_identity.current: Read complete after 1s [id=158237136693]
module.eks_blueprints.data.aws_caller_identity.current: Read complete after 1s [id=158237136693]
module.eks_blueprints.data.aws_iam_session_context.current: Reading...
module.eks_blueprints.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::158237136693:user/service.infra-k8s.deployer]
module.eks_blueprints.module.aws_eks.data.aws_caller_identity.current: Read complete after 1s [id=158237136693]
module.eks_blueprints.module.aws_eks.module.kms.data.aws_caller_identity.current: Read complete after 1s [id=158237136693]
module.eks_blueprints.data.aws_iam_policy_document.eks_key: Reading...
module.eks_blueprints.data.aws_iam_policy_document.eks_key: Read complete after 0s [id=4025009984]
module.eks_blueprints.module.kms[0].aws_kms_key.this: Refreshing state... [id=8d8bc25a-678c-4493-ad07-7d2e215c3c1a]
data.aws_availability_zones.available: Read complete after 1s [id=ap-southeast-2]
module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20221022101602452100000002-20221022101603510300000003]
module.eks_blueprints.module.kms[0].aws_kms_alias.this: Refreshing state... [id=alias/django-for-impatient]
module.eks_blueprints.module.aws_eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"]: Refreshing state... [id=django-for-impatient-cluster-role-20221022104049358700000003]
module.eks_blueprints.module.aws_eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"]: Refreshing state... [id=django-for-impatient-cluster-role-20221022104049372300000004]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0ffab94f437dfb623]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0cea5a00b2c07fe34]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-06b2923dedb8e64b3]
module.eks_blueprints.module.aws_eks.aws_security_group.node[0]: Refreshing state... [id=sg-0f59e37d6370a61c1]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0ad8fb60c88cb7fe9]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-06953b6631b897b53]
module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-03450afa57a6288df]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0d639fd63ce2ba601]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0bbfe145c7abf377f]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-088414014b168aae0]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-096a58e583e0ac47c]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00907bce6cbcc6b47]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-03e0c337a4a53b1c6]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-006e44e2327f6304e]
module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-05000514d72d54e9c]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-08d5a0fbd25a558cd]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-039b53d79664f15ea]
module.eks_blueprints.module.aws_eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0e312562fe97033cb]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-06953b6631b897b531080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-01adb055e884040f2]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0443c0238a54bcbe5]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-029ed30db96eaa5fd]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ef380c7e09deffa6]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-028dca37fad47a0cd]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0746a4928e69fa71c]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0ebf8b4682b095f4e]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=infra-k8s]
module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-0fe0c6935f00b0a3a]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0025f0003669e533e]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-06fb9bbd7518f2d9f]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.cluster["egress_nodes_443"]: Refreshing state... [id=sgrule-457845762]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3807632150]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.cluster["egress_nodes_kubelet"]: Refreshing state... [id=sgrule-278850341]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-039b53d79664f15ea1080289494]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-4238488871]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_ntp_tcp"]: Refreshing state... [id=sgrule-2073015025]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_cluster_443"]: Refreshing state... [id=sgrule-591942786]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_ntp_udp"]: Refreshing state... [id=sgrule-85039100]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-260035800]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_self_coredns_tcp"]: Refreshing state... [id=sgrule-742987524]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2952322807]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-195525912]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-2756808687]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_self_coredns_udp"]: Refreshing state... [id=sgrule-2720961890]
module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-0feb2e13632470598]
module.eks_blueprints.module.aws_eks.aws_eks_cluster.this[0]: Refreshing state... [id=django-for-impatient]
module.eks_blueprints.module.aws_eks.data.tls_certificate.this[0]: Reading...
module.eks_blueprints.module.aws_eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-0cb77f68314481fa4,Environment]
module.eks_blueprints.module.aws_eks.aws_ec2_tag.cluster_primary_security_group["GithubRepo"]: Refreshing state... [id=sg-0cb77f68314481fa4,GithubRepo]
module.eks_blueprints.module.aws_eks.aws_ec2_tag.cluster_primary_security_group["GithubOrg"]: Refreshing state... [id=sg-0cb77f68314481fa4,GithubOrg]
data.aws_eks_addon_version.latest["kube-proxy"]: Reading...
data.aws_eks_addon_version.latest["vpc-cni"]: Reading...
module.eks_blueprints.module.aws_eks.aws_ec2_tag.cluster_primary_security_group["DeployedBy"]: Refreshing state... [id=sg-0cb77f68314481fa4,DeployedBy]
module.eks_blueprints.data.aws_eks_cluster.cluster[0]: Reading...
data.aws_eks_cluster_auth.this: Reading...
data.aws_eks_cluster_auth.this: Read complete after 0s [id=django-for-impatient]
module.eks_blueprints.data.aws_eks_cluster.cluster[0]: Read complete after 1s [id=django-for-impatient]
module.eks_blueprints.data.http.eks_cluster_readiness[0]: Reading...
module.eks_blueprints_kubernetes_addons.module.fargate_fluentbit[0].kubernetes_namespace.aws_observability: Refreshing state... [id=aws-observability]
data.aws_eks_addon_version.latest["vpc-cni"]: Read complete after 1s [id=vpc-cni]
data.aws_eks_addon_version.latest["kube-proxy"]: Read complete after 1s [id=kube-proxy]
module.eks_blueprints.module.aws_eks.data.tls_certificate.this[0]: Read complete after 1s [id=46adad793ade1fb181af4d4f685addbc37aa907c]
module.eks_blueprints.module.aws_eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::158237136693:oidc-provider/oidc.eks.ap-southeast-2.amazonaws.com/id/2865CC1660B5C3EF8DF0B469B436CB54]
module.eks_blueprints.data.http.eks_cluster_readiness[0]: Read complete after 0s [id=https://2865CC1660B5C3EF8DF0B469B436CB54.gr7.ap-southeast-2.eks.amazonaws.com/healthz]
module.eks_blueprints.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.eks_blueprints.module.aws_eks_fargate_profiles["default"].aws_iam_policy.cwlogs[0]: Refreshing state... [id=arn:aws:iam::158237136693:policy/django-for-impatient-default-cwlogs]
module.eks_blueprints.module.aws_eks_fargate_profiles["default"].aws_iam_role.fargate[0]: Refreshing state... [id=django-for-impatient-default]
module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].aws_iam_role.fargate[0]: Refreshing state... [id=django-for-impatient-kube-system]
module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].aws_iam_policy.cwlogs[0]: Refreshing state... [id=arn:aws:iam::158237136693:policy/django-for-impatient-kube-system-cwlogs]
module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].aws_iam_role_policy_attachment.cwlogs[0]: Refreshing state... [id=django-for-impatient-kube-system-20221022105123581000000006]
module.eks_blueprints.module.aws_eks_fargate_profiles["default"].aws_iam_role_policy_attachment.cwlogs[0]: Refreshing state... [id=django-for-impatient-default-20221022105123637900000009]
module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].aws_iam_role_policy_attachment.fargate_pod_execution_role_policy["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"]: Refreshing state... [id=django-for-impatient-kube-system-20221022105123572600000005]
module.eks_blueprints.module.aws_eks_fargate_profiles["default"].aws_iam_role_policy_attachment.fargate_pod_execution_role_policy["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"]: Refreshing state... [id=django-for-impatient-default-20221022105123628600000008]
module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].aws_eks_fargate_profile.eks_fargate: Refreshing state... [id=django-for-impatient:kube-system]
module.eks_blueprints.module.aws_eks_fargate_profiles["default"].aws_eks_fargate_profile.eks_fargate: Refreshing state... [id=django-for-impatient:default]
module.eks_blueprints_kubernetes_addons.time_sleep.dataplane: Refreshing state... [id=2022-10-22T10:55:19Z]
module.eks_blueprints_kubernetes_addons.data.aws_eks_cluster.eks_cluster: Reading...
module.eks_blueprints_kubernetes_addons.data.aws_eks_cluster.eks_cluster: Read complete after 1s [id=django-for-impatient]
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].data.aws_eks_addon_version.this: Reading...
module.eks_blueprints_kubernetes_addons.module.aws_kube_proxy[0].data.aws_eks_addon_version.this: Reading...
module.eks_blueprints_kubernetes_addons.module.aws_vpc_cni[0].data.aws_eks_addon_version.this: Reading...
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].time_sleep.this: Refreshing state... [id=2022-10-22T10:56:20Z]
module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].data.aws_iam_policy_document.aws_lb: Reading...
module.eks_blueprints_kubernetes_addons.module.fargate_fluentbit[0].kubernetes_config_map.aws_logging: Refreshing state... [id=aws-observability/aws-logging]
module.eks_blueprints_kubernetes_addons.module.kubernetes_dashboard[0].module.helm_addon.helm_release.addon[0]: Refreshing state... [id=kubernetes-dashboard]
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].module.cluster_proportional_autoscaler[0].module.helm_addon.helm_release.addon[0]: Refreshing state... [id=cluster-proportional-autoscaler]
module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].data.aws_iam_policy_document.aws_lb: Read complete after 0s [id=2633998141]
module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].aws_iam_policy.aws_load_balancer_controller: Refreshing state... [id=arn:aws:iam::158237136693:policy/django-for-impatient-lb-irsa]
module.eks_blueprints_kubernetes_addons.module.aws_vpc_cni[0].module.irsa_addon[0].aws_iam_role.irsa[0]: Refreshing state... [id=django-for-impatient-aws-node-irsa]
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].data.aws_eks_cluster_auth.this: Reading...
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].data.aws_eks_cluster_auth.this: Read complete after 0s [id=django-for-impatient]
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].null_resource.remove_default_coredns_deployment[0]: Refreshing state... [id=6989773204784446481]
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].null_resource.modify_kube_dns[0]: Refreshing state... [id=5032259336032441595]
module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.module.irsa[0].aws_iam_role.irsa[0]: Refreshing state... [id=django-for-impatient-aws-load-balancer-controller-sa-irsa]
module.eks_blueprints_kubernetes_addons.module.aws_vpc_cni[0].data.aws_eks_addon_version.this: Read complete after 0s [id=vpc-cni]
module.eks_blueprints_kubernetes_addons.module.aws_kube_proxy[0].data.aws_eks_addon_version.this: Read complete after 0s [id=kube-proxy]
module.eks_blueprints_kubernetes_addons.module.aws_kube_proxy[0].aws_eks_addon.kube_proxy: Refreshing state... [id=django-for-impatient:kube-proxy]
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].data.aws_eks_addon_version.this: Read complete after 0s [id=coredns]
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].module.helm_addon[0].helm_release.addon[0]: Refreshing state... [id=coredns]
module.eks_blueprints_kubernetes_addons.module.aws_vpc_cni[0].aws_eks_addon.vpc_cni: Refreshing state... [id=django-for-impatient:vpc-cni]
module.eks_blueprints_kubernetes_addons.module.aws_vpc_cni[0].module.irsa_addon[0].aws_iam_role_policy_attachment.irsa[0]: Refreshing state... [id=django-for-impatient-aws-node-irsa-2022102210552081890000000d]
module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.module.irsa[0].aws_iam_role_policy_attachment.irsa[0]: Refreshing state... [id=django-for-impatient-aws-load-balancer-controller-sa-irsa-2022102210552092860000000e]
module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.module.irsa[0].kubernetes_service_account_v1.irsa[0]: Refreshing state... [id=kube-system/aws-load-balancer-controller-sa]
module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.helm_release.addon[0]: Refreshing state... [id=aws-load-balancer-controller]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].module.helm_addon[0].helm_release.addon[0] has changed
  ~ resource "helm_release" "addon" {
        id                         = "coredns"
      ~ metadata                   = [
          ~ {
                name        = "coredns"
              ~ values      = jsonencode(
                  ~ {
                      ~ blueprints     = {
                          ~ connection = 6989773204784446481 -> 6989773204784446000
                        }
                        # (5 unchanged elements hidden)
                    }
                )
                # (5 unchanged elements hidden)
            },
        ]
        name                       = "coredns"
        # (28 unchanged attributes hidden)

      ~ postrender {
          + args = []
        }

        # (2 unchanged blocks hidden)
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.helm_release.addon[0] has changed
  ~ resource "helm_release" "addon" {
        id                         = "aws-load-balancer-controller"
        name                       = "aws-load-balancer-controller"
        # (29 unchanged attributes hidden)

      ~ postrender {
          + args = []
        }

        # (4 unchanged blocks hidden)
    }

  # module.eks_blueprints_kubernetes_addons.module.kubernetes_dashboard[0].module.helm_addon.helm_release.addon[0] has changed
  ~ resource "helm_release" "addon" {
        id                         = "kubernetes-dashboard"
      ~ metadata                   = [
          ~ {
                name        = "kubernetes-dashboard"
              ~ values      = jsonencode(
                  ~ {} -> null
                )
                # (5 unchanged elements hidden)
            },
        ]
        name                       = "kubernetes-dashboard"
        # (28 unchanged attributes hidden)

      ~ postrender {
          + args = []
        }
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].module.cluster_proportional_autoscaler[0].module.helm_addon.helm_release.addon[0] has changed
  ~ resource "helm_release" "addon" {
        id                         = "cluster-proportional-autoscaler"
        name                       = "cluster-proportional-autoscaler"
        # (29 unchanged attributes hidden)

      ~ postrender {
          + args = []
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks_blueprints.kubernetes_config_map.aws_auth[0] will be updated in-place
  ~ resource "kubernetes_config_map" "aws_auth" {
      ~ data        = {
          ~ "mapRoles"    = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  - "system:node-proxier"
                  "rolearn": "arn:aws:iam::158237136693:role/django-for-impatient-default"
                  "username": "system:node:{{SessionName}}"
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  - "system:node-proxier"
                  "rolearn": "arn:aws:iam::158237136693:role/django-for-impatient-kube-system"
                  "username": "system:node:{{SessionName}}"
                - "groups":
                  - "system:masters"
              -   "rolearn": ""
              +   "rolearn": "arn:aws:iam::158237136693:role/AWSReservedSSO_AdministratorAccess_17b27ee099385ed9"
                  "username": "ops-role"
            EOT
            # (2 unchanged elements hidden)
        }
        id          = "kube-system/aws-auth"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["default"].data.aws_iam_policy_document.cwlogs[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "cwlogs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["default"].data.aws_iam_policy_document.fargate_assume_role_policy[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "fargate_assume_role_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "EKSFargateAssumeRole"

          + principals {
              + identifiers = [
                  + "eks-fargate-pods.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["default"].aws_iam_policy.cwlogs[0] will be updated in-place
  ~ resource "aws_iam_policy" "cwlogs" {
        id          = "arn:aws:iam::158237136693:policy/django-for-impatient-default-cwlogs"
        name        = "django-for-impatient-default-cwlogs"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {
            "DeployedBy"  = "Terraform"
            "Environment" = "dev"
            "GithubOrg"   = "ethanbayliss"
            "GithubRepo"  = "infra-k8s"
        }
        # (5 unchanged attributes hidden)
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["default"].aws_iam_role.fargate[0] will be updated in-place
  ~ resource "aws_iam_role" "fargate" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "eks-fargate-pods.amazonaws.com"
                        }
                      - Sid       = "EKSFargateAssumeRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "django-for-impatient-default"
        name                  = "django-for-impatient-default"
        tags                  = {
            "DeployedBy"  = "Terraform"
            "Environment" = "dev"
            "GithubOrg"   = "ethanbayliss"
            "GithubRepo"  = "infra-k8s"
        }
        # (9 unchanged attributes hidden)
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].data.aws_iam_policy_document.cwlogs[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "cwlogs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].data.aws_iam_policy_document.fargate_assume_role_policy[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "fargate_assume_role_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "EKSFargateAssumeRole"

          + principals {
              + identifiers = [
                  + "eks-fargate-pods.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].aws_iam_policy.cwlogs[0] will be updated in-place
  ~ resource "aws_iam_policy" "cwlogs" {
        id          = "arn:aws:iam::158237136693:policy/django-for-impatient-kube-system-cwlogs"
        name        = "django-for-impatient-kube-system-cwlogs"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {
            "DeployedBy"  = "Terraform"
            "Environment" = "dev"
            "GithubOrg"   = "ethanbayliss"
            "GithubRepo"  = "infra-k8s"
        }
        # (5 unchanged attributes hidden)
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].aws_iam_role.fargate[0] will be updated in-place
  ~ resource "aws_iam_role" "fargate" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "eks-fargate-pods.amazonaws.com"
                        }
                      - Sid       = "EKSFargateAssumeRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "django-for-impatient-kube-system"
        name                  = "django-for-impatient-kube-system"
        tags                  = {
            "DeployedBy"  = "Terraform"
            "Environment" = "dev"
            "GithubOrg"   = "ethanbayliss"
            "GithubRepo"  = "infra-k8s"
        }
        # (9 unchanged attributes hidden)
    }

  # module.eks_blueprints_kubernetes_addons.module.argocd[0].kubernetes_namespace_v1.this[0] will be created
  + resource "kubernetes_namespace_v1" "this" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks_blueprints_kubernetes_addons.module.argocd[0].module.helm_addon.helm_release.addon[0] will be created
  + resource "helm_release" "addon" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + description                = "The ArgoCD Helm Chart deployment configuration"
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argo-cd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 1200
      + values                     = [
          + <<-EOT
                redis-ha:
                  enabled: true
                
                controller:
                  enableStatefulSet: true
                
                server:
                  autoscaling:
                    enabled: true
                    minReplicas: 2
                
                repoServer:
                  autoscaling:
                    enabled: true
                    minReplicas: 2
            EOT,
        ]
      + verify                     = false
      + version                    = "4.9.14"
      + wait                       = false
      + wait_for_jobs              = false

      + postrender {}
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.helm_release.addon[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "helm_release" "addon" {
      - atomic                     = false -> null
      - chart                      = "aws-load-balancer-controller" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = false -> null
      - dependency_update          = false -> null
      - description                = "aws-load-balancer-controller Helm Chart for ingress resources" -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "aws-load-balancer-controller" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version = "v2.4.2"
              - chart       = "aws-load-balancer-controller"
              - name        = "aws-load-balancer-controller"
              - namespace   = "kube-system"
              - revision    = 1
              - values      = jsonencode(
                    {
                      - clusterName         = "django-for-impatient"
                      - image               = {
                          - repository = "602401143452.dkr.ecr.ap-southeast-2.amazonaws.com/amazon/aws-load-balancer-controller"
                        }
                      - podDisruptionBudget = {
                          - maxUnavailable = 1
                        }
                      - region              = "ap-southeast-2"
                      - serviceAccount      = {
                          - create = false
                          - name   = "aws-load-balancer-controller-sa"
                        }
                      - vpcId               = "vpc-03450afa57a6288df"
                    }
                )
              - version     = "1.4.3"
            },
        ] -> null
      - name                       = "aws-load-balancer-controller" -> null
      - namespace                  = "kube-system" -> null
      - pass_credentials           = false -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://aws.github.io/eks-charts" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 1200 -> null
      - values                     = [
          - <<-EOT
                clusterName: django-for-impatient
                region: ap-southeast-2
                image:
                  repository: 602401143452.dkr.ecr.ap-southeast-2.amazonaws.com/amazon/aws-load-balancer-controller
            EOT,
        ] -> null
      - verify                     = false -> null
      - version                    = "1.4.3" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null

      - postrender {
          - args = [] -> null
        }

      - set {
          - name  = "podDisruptionBudget.maxUnavailable" -> null
          - value = "1" -> null
        }
      - set {
          - name  = "serviceAccount.create" -> null
          - value = "false" -> null
        }
      - set {
          - name  = "serviceAccount.name" -> null
          - value = "aws-load-balancer-controller-sa" -> null
        }
      - set {
          - name  = "vpcId" -> null
          - value = "vpc-03450afa57a6288df" -> null
        }
    }

  # module.eks_blueprints_kubernetes_addons.module.kubernetes_dashboard[0].module.helm_addon.helm_release.addon[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "helm_release" "addon" {
      - atomic                     = false -> null
      - chart                      = "kubernetes-dashboard" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = false -> null
      - dependency_update          = false -> null
      - description                = "Kubernetes Dashboard Helm Chart" -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "kubernetes-dashboard" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version = "2.6.0"
              - chart       = "kubernetes-dashboard"
              - name        = "kubernetes-dashboard"
              - namespace   = "default"
              - revision    = 1
              - values      = "null"
              - version     = "5.7.0"
            },
        ] -> null
      - name                       = "kubernetes-dashboard" -> null
      - namespace                  = "default" -> null
      - pass_credentials           = false -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://kubernetes.github.io/dashboard/" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 1200 -> null
      - values                     = [] -> null
      - verify                     = false -> null
      - version                    = "5.7.0" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null

      - postrender {
          - args = [] -> null
        }
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].module.cluster_proportional_autoscaler[0].module.helm_addon.helm_release.addon[0] is tainted, so must be replaced
-/+ resource "helm_release" "addon" {
      ~ id                         = "cluster-proportional-autoscaler" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version = "1.8.4"
              - chart       = "cluster-proportional-autoscaler"
              - name        = "cluster-proportional-autoscaler"
              - namespace   = "kube-system"
              - revision    = 1
              - values      = jsonencode(
                    {
                      - config             = {
                          - linear = {
                              - coresPerReplica           = 256
                              - includeUnschedulableNodes = true
                              - max                       = 100
                              - min                       = 1
                              - nodesPerReplica           = 16
                              - preventSinglePointFailure = true
                            }
                        }
                      - nameOverride       = "coredns"
                      - options            = {
                          - target = "deployment/coredns"
                        }
                      - podSecurityContext = {
                          - fsGroup            = 65534
                          - seccompProfile     = {
                              - type = "RuntimeDefault"
                            }
                          - supplementalGroups = [
                              - 65534,
                            ]
                        }
                      - tolerations        = [
                          - {
                              - key      = "CriticalAddonsOnly"
                              - operator = "Exists"
                            },
                        ]
                    }
                )
              - version     = "1.0.0"
            },
        ] -> (known after apply)
        name                       = "cluster-proportional-autoscaler"
      ~ status                     = "failed" -> "deployed"
        # (27 unchanged attributes hidden)

      ~ postrender {
          - args = [] -> null
        }
    }

Plan: 3 to add, 5 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: ethanbayliss, Action: `pull_request`, Workflow: `Terraform Testing`*